tyt319/strain-rosette/Package/SVD/APM32F403.svd
<?xml version="1.0"?>
<device xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" schemaVersion="1.1" xs:noNamespaceSchemaLocation="CMSIS-SVD_Schema_1_1.xsd">
    <name>APM32F403</name>
    <version>1.0</version>
    <description>APM32F403xx</description>
    <!-- details about the cpu embedded in the device -->
    <cpu>
        <name>CM4</name>
        <revision>r1p0</revision>
        <endian>little</endian>
        <mpuPresent>false</mpuPresent>
        <fpuPresent>false</fpuPresent>
        <nvicPrioBits>4</nvicPrioBits>
        <vendorSystickConfig>false</vendorSystickConfig>
    </cpu>
    <!--Bus Interface Properties-->
    <!--Cortex-M4 is byte addressable-->
    <addressUnitBits>8</addressUnitBits>
    <!--the maximum data bit width accessible within a single transfer-->
    <width>32</width>
    <!--Register Default Properties-->
    <size>0x20</size>
    <resetValue>0x0</resetValue>
    <resetMask>0xFFFFFFFF</resetMask>
    <peripherals>
        
        
        
        
        
        
        
        
        
        
        
        
        
        
        
        
        
        
        <peripheral>
            <name>SPI1</name>
            <description>Serial peripheral interface</description>
            <groupName>SPI</groupName>
            <baseAddress>0x40013000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x400</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>SPI1</name>
                <description>SPI1 global interrupt</description>
                <value>35</value>
            </interrupt>
            <registers>
                <register>
                    <name>CTRL1</name>
                    <displayName>CTRL1</displayName>
                    <description>control register 1</description>
                    <addressOffset>0x0</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue><fields><field>
							<name>CPHA</name><description>Clock phase</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>CPOL</name><description>Clock polarity</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>MSMCFG</name><description>Master selection</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>BRSEL</name><description>Baud rate control</description>
							<bitOffset>3</bitOffset>
							<bitWidth>3</bitWidth>
						</field><field>
							<name>SPIEN</name>
							<description>SPI enable</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>LSBSEL</name><description>Frame format</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>ISSEL</name>
							<description>Internal slave select</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>SSEN</name><description>Software slave management</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>RXOMEN</name>
							<description>Receive only</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>DFLSEL</name>
							<description>Data frame format</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>CRCNXT</name>
							<description>CRC transfer next</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>CRCEN</name>
							<description>Hardware CRC calculation
              enable</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>BMOEN</name>
							<description>Output enable in bidirectional
              mode</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>BMEN</name>
							<description>Bidirectional data mode
              enable</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
						</field></fields>
                    
                </register>
                <register>
                    <name>CTRL2</name>
                    <displayName>CTRL2</displayName>
                    <description>control register 2</description>
                    <addressOffset>0x4</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue><fields>
						<field>
							<name>RXDEN</name>
							<description>Rx buffer DMA enable</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>TXDEN</name>
							<description>Tx buffer DMA enable</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>SSOEN</name>
							<description>SS output enable</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>ERRIEN</name>
							<description>Error interrupt enable</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>RXBNEIEN</name>
							<description>RX buffer not empty interrupt
              enable</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>TXBEIEN</name>
							<description>Tx buffer empty interrupt
              enable</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
                    
                </register>
                <register>
                    <name>STS</name>
                    <displayName>STS</displayName>
                    <description>status register</description>
                    <addressOffset>0x8</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x0002</resetValue><fields>
						<field>
							<name>RXBNEFLG</name>
							<description>Receive buffer not empty</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field><field>
							<name>TXBEFLG</name>
							<description>Transmit buffer empty</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field><field>
							<name>SCHDIR</name>
							<description>Channel side</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field><field>
							<name>UDRFLG</name>
							<description>Underrun flag</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field><field>
							<name>CRCEFLG</name>
							<description>CRC error flag</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field><field>
							<name>MEFLG</name>
							<description>Mode fault</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field><field>
							<name>OVRFLG</name>
							<description>Overrun flag</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field><field>
							<name>BSYFLG</name>
							<description>Busy flag</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
                    
                </register>
                <register>
                    <name>DATA</name>
                    <displayName>DATA</displayName>
                    <description>data register</description>
                    <addressOffset>0xC</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <fields>
                        <field>
                            <name>DATA</name>
                            <description>Data register</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CRCPOLY</name>
                    <displayName>CRCPOLY</displayName>
                    <description>CRC polynomial register</description>
                    <addressOffset>0x10</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x0007</resetValue>
                    <fields>
                        <field>
                            <name>CRCPOLY</name>
                            <description>CRC polynomial register</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RXCRC</name>
                    <displayName>RXCRC</displayName>
                    <description>RX CRC register</description>
                    <addressOffset>0x14</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x0000</resetValue>
                    <fields>
                        <field>
                            <name>RXCRC</name>
                            <description>Rx CRC register</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TXCRC</name>
                    <displayName>TXCRC</displayName>
                    <description>TX CRC register</description>
                    <addressOffset>0x18</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x0000</resetValue>
                    <fields>
                        <field>
                            <name>TXCRC</name>
                            <description>Tx CRC register</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>I2SCFG</name>
                    <displayName>I2SCFG</displayName>
                    <description>I2S configuration register</description>
                    <addressOffset>0x1C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <fields>
                        <field>
                            <name>MODESEL</name>
                            <description>I2S mode selection</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>I2SEN</name>
                            <description>I2S Enable</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>I2SMOD</name>
                            <description>I2S configuration mode</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>PFSSEL</name>
                            <description>PCM frame synchronization</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>I2SSSEL</name>
                            <description>I2S standard selection</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>CPOL</name>
                            <description>Steady state clock
              polarity</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DATALEN</name>
                            <description>Data length to be
              transferred</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>CHLEN</name>
                            <description>Channel length (number of bits per audio channel)</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>I2SPSC</name>
                    <displayName>I2SPSC</displayName>
                    <description>I2S prescaler register</description>
                    <addressOffset>0x20</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x0002</resetValue>
                    <fields>
                        <field>
                            <name>MCOEN</name>
                            <description>Master clock output enable</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ODDPSC</name>
                            <description>Odd factor for the
              prescaler</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>I2SPSC</name>
                            <description>I2S Linear prescaler</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
