tyt319/strain-rosette/Package/SVD/APM32F403.svd
            </registers>
        </peripheral><peripheral>
            <name>DBGMCU</name>
            <description>Debug support</description>
            <groupName>DBGMCU</groupName>
            <baseAddress>0xE0042000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x400</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>IDCODE</name>
                    <displayName>IDCODE</displayName>
                    <description>IDCODE</description>
                    <addressOffset>0x0</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x001D0012</resetValue>
                    <fields>
                        <field>
                            <name>EQR</name>
                            <description>Equipment Recognition</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>12</bitWidth>
                        </field>
                        <field>
                            <name>WVR</name>
                            <description>Wafer Version Recognition</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CFG</name>
                    <displayName>CFG</displayName>
                    <description>Control Register</description>
                    <addressOffset>0x4</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SLEEP_CLK_STS</name>
                            <description>Configure clock status when MCU is debugged in sleep mode</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>STOP_CLK_STS</name>
                            <description>Configure clock status when MCU is debugged in stop mode</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>STANDBY_CLK_STS</name>
                            <description>Configure clock status when MCU is debugged in standby mode</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TRACE_IOEN</name>
                            <description>Trace Debug Pin Enable</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TRACE_MODE</name>
                            <description>Trace Debug Pin Mode Configure</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>IWDT_STS</name>
                            <description>Configure Independent Watchdog Work Status When Core Is in Halted</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>WWDT_STS</name>
                            <description>Configure Window Watchdog Work Status When Core Is in Halted</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TMR1_STS</name>
                            <description>Configure Timer Work Status When Core Is in Halted</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TMR2_STS</name>
                            <description>Configure Timer Work Status When Core Is in Halted</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TMR3_STS</name>
                            <description>Configure Timer Work Status When Core Is in Halted</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TMR4_STS</name>
                            <description>Configure Timer Work Status When Core Is in Halted</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CAN1_STS</name>
                            <description>Configure CAN1 Work Status When Core Is in Halted</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>I2C1_SMBUS_TIMEOUT_STS</name>
                            <description>Configure I2C1_SMBUS_TIMEOUT Work Status When Core Is in Halted</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TMR5_STS</name>
                            <description>ConfigureTimer Work Status When Core Is in Halted</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TMR8_STS</name>
                            <description>ConfigureTimer Work Status When Core Is in Halted</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CAN2_STS</name>
                            <description>Configure CAN2
Work Status When Core Is in Halted</description>
                            <bitOffset>21</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
