tyt319/strain-rosette/Package/SVD/APM32F403.svd
            </registers>
        </peripheral><peripheral derivedFrom="USART3">
            <name>USART1</name>
            <baseAddress>0x40013800</baseAddress>
            <interrupt>
                <name>USART1</name>
                <description>USART1 global interrupt</description>
                <value>37</value>
            </interrupt>
        </peripheral><peripheral derivedFrom="USART3">
            <name>USART2</name>
            <baseAddress>0x40004400</baseAddress>
            <interrupt>
                <name>USART2</name>
                <description>USART2 global interrupt</description>
                <value>38</value>
            </interrupt>
        </peripheral><peripheral derivedFrom="USART3">
            <name>UART4</name>
            <baseAddress>0x40004C00</baseAddress><addressBlock>
                <offset>0x0</offset>
                <size>0x400</size>
                <usage>registers</usage>
            </addressBlock>
            
            <interrupt>
                <name>UART4</name>
                <description>UART4 global interrupt</description>
                <value>52</value>
            </interrupt>
        </peripheral><peripheral>
            <name>PMU</name>
            <description>Power control</description>
            <groupName>PMU</groupName>
            <baseAddress>0x40007000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x400</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>PVD</name>
                <description>PVD through EINT line detection interrupt</description>
                <value>1</value>
            </interrupt>
            <registers>
                <register>
                    <name>CTRL</name>
                    <displayName>CTRL</displayName>
                    <description>power control register</description>
                    <addressOffset>0x0</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>BPWEN</name>
                            <description>Disable backup domain write protection</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PLSEL</name>
                            <description>PVD level selection</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>PVDEN</name>
                            <description>Power voltage detector enable</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SBFLGCLR</name>
                            <description>Clear standby flag</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>WUFLGCLR</name>
                            <description>Clear wakeup flag</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PDDSCFG</name>
                            <description>Power down deepsleep</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LPDSCFG</name>
                            <description>Low-power deep sleep</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CSTS</name>
                    <displayName>CSTS</displayName>
                    <description>power control/status register</description>
                    <addressOffset>0x4</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>WUEFLG</name>
                            <description>Wakeup flag</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>SBFLG</name>
                            <description>Standby flag</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>PVDOFLG</name>
                            <description>PVD output</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>WKUPCFG</name>
                            <description>Enable WKUP pin</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
