tyt319/strain-rosette/Package/SVD/APM32F403.svd
            </registers>
        </peripheral>
        <peripheral derivedFrom="TMR3">
            <name>TMR4</name>
            <baseAddress>0x40000800</baseAddress>
            <interrupt>
                <name>TMR4</name>
                <description>TMR4 global interrupt</description>
                <value>30</value>
            </interrupt>
        </peripheral>
        <peripheral derivedFrom="TMR3">
            <name>TMR5</name>
            
            
            <baseAddress>0x40000C00</baseAddress>
            
            <interrupt>
                <name>TMR5</name>
                <description>TMR5 global interrupt</description>
                <value>50</value>
            </interrupt>
            
        </peripheral>
        
        
        
        
        
        
        
        
        <peripheral>
            <name>CAN1</name>
            <description>Controller area network</description>
            <groupName>CAN</groupName>
            <baseAddress>0x40006400</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x400</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>CAN1_TX</name>
                <description>CAN1 TX interrupts</description>
                <value>19</value>
            </interrupt>
            <interrupt>
                <name>CAN1_RX0</name>
                <description>CAN1 RX0 interrupts</description>
                <value>20</value>
            </interrupt>
            <interrupt>
                <name>CAN1_RX1</name>
                <description>CAN1 RX1 interrupts</description>
                <value>21</value>
            </interrupt>
            <interrupt>
                <name>CAN1_SCE</name>
                <description>CAN1 SCE interrupt</description>
                <value>22</value>
            </interrupt>
            <registers>
                <register>
                    <name>MCTRL</name>
                    <displayName>MCTRL</displayName>
                    <description>CAN Master control register</description>
                    <addressOffset>0x0</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>INITREQ</name>
                            <description>INITREQ</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SLEEPREQ</name>
                            <description>SLEEPREQ</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TXFPCFG</name>
                            <description>TXFPCFG</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RXFLOCK</name>
                            <description>RXFLOCK</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ARTXMD</name>
                            <description>ARTXMD</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>AWUPCFG</name>
                            <description>AWUPCFG</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ALBOFFM</name>
                            <description>ALBOFFM</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SWRST</name>
                            <description>SWRST</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DBGFRZE</name>
                            <description>DBGFRZE</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MSTS</name>
                    <displayName>MSTS</displayName>
                    <description>CAN Master States register</description>
                    <addressOffset>0x4</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>INITFLG</name>
                            <description>INITFLG</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>SLEEPFLG</name>
                            <description>SLEEPFLG</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ERRIFLG</name>
                            <description>ERRIFLG</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>WUPIFLG</name>
                            <description>WUPIFLG</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SLEEPIFLG</name>
                            <description>SLEEPIFLG</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TXMFLG</name>
                            <description>TXMFLG</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RXMFLG</name>
                            <description>RXMFLG</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>LSAMVALUE</name>
                            <description>LSAMVALUE</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RXSIGL</name>
                            <description>RXSIGL</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TXSTS</name>
                    <displayName>TXSTS</displayName>
                    <description>CAN Send States register</description>
                    <addressOffset>0x8</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>REQCFLG0</name>
                            <description>REQCFLG0</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TXSUSFLG0</name>
                            <description>TXSUSFLG0</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ARBLSTFLG0</name>
                            <description>ARBLSTFLG0</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TXERRFLG0</name>
                            <description>TXERRFLG0</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ABREQFLG0</name>
                            <description>ABREQFLG0</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>REQCFLG1</name>
                            <description>REQCFLG1</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TXSUSFLG1</name>
                            <description>TXSUSFLG1</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ARBLSTFLG1</name>
                            <description>ARBLSTFLG1</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TXERRFLG1</name>
                            <description>TXERRFLG1</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ABREQFLG1</name>
                            <description>ABREQFLG1</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>REQCFLG2</name>
                            <description>REQCFLG2</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TXSUSFLG2</name>
                            <description>TXSUSFLG2</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ARBLSTFLG2</name>
                            <description>ARBLSTFLG2</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TXERRFLG2</name>
                            <description>TXERRFLG2</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ABREQFLG2</name>
                            <description>ABREQFLG2</description>
                            <bitOffset>23</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EMNUM</name>
                            <description>EMNUM</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>TXMEFLG0</name>
                            <description>TXMEFLG0</description>
                            <bitOffset>26</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>TXMEFLG1</name>
                            <description>TXMEFLG1</description>
                            <bitOffset>27</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>TXMEFLG2</name>
                            <description>TXMEFLG2</description>
                            <bitOffset>28</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>LOWESTP0</name>
                            <description>LOWESTP0</description>
                            <bitOffset>29</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>LOWESTP1</name>
                            <description>LOWESTP1</description>
                            <bitOffset>30</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>LOWESTP2</name>
                            <description>LOWESTP2</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RXF0</name>
                    <displayName>RXF0</displayName>
                    <description>CAN Receive FIFO 0 register</description>
                    <addressOffset>0xC</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>FMNUM0</name>
                            <description>FMNUM0</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>FFULLFLG0</name>
                            <description>FFULLFLG0</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FOVRFLG0</name>
                            <description>FOVRFLG0</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RFOM0</name>
                            <description>RFOM0</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RXF1</name>
                    <displayName>RXF1</displayName>
                    <description>CAN Receive FIFO 1 register</description>
                    <addressOffset>0x10</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>FMNUM1</name>
                            <description>FMNUM1</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>FFULLFLG1</name>
                            <description>FFULLFLG1</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FOVRFLG1</name>
                            <description>FOVRFLG1</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RFOM1</name>
                            <description>RFOM1</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
